<script setup>
import { ref } from 'vue'
import { RouterLink } from 'vue-router';

const MenuOchil = ref(false)
</script>

<template>
    <section class="bg-[#898e9b] pb-[93px]">
        <div class="w- h-[64px] flex items-center">
            <div class="w-[1090px] m-auto mt-[20px]">
                <nav class="flex items-center justify-between container_large">
                    <RouterLink to="/sotuvchi">
                        <svg xmlns="http://www.w3.org/2000/svg" width="114" height="36" fill="none" viewBox="0 0 114 36" class="layout__header-logo" data-v-c5e31979=""><path fill="#ABABAB" d="M18.035 35.815c9.772 0 17.695-7.973 17.695-17.807S27.807.202 18.035.202.34 8.174.34 18.008s7.922 17.807 17.695 17.807"></path><path fill="#3B1082" d="M5.008 20.175c-.716-4.087-1.074-6.13-.593-7.84A7.76 7.76 0 0 1 7.327 8.15c1.432-1.039 3.463-1.4 7.524-2.12l1.99-.353c4.06-.72 6.091-1.08 7.79-.597a7.7 7.7 0 0 1 4.159 2.93c1.032 1.441 1.39 3.485 2.107 7.572.716 4.086 1.074 6.13.593 7.84a7.76 7.76 0 0 1-2.912 4.185c-1.432 1.039-3.463 1.399-7.524 2.12l-1.99.352c-4.06.721-6.091 1.081-7.79.598a7.7 7.7 0 0 1-4.159-2.93c-1.032-1.442-1.39-3.485-2.107-7.572"></path><path fill="#fff" d="M22.933 12.375c.534.118 1.05.22 1.557.35.54.138 1.073.305 1.607.456.075.022.105.051.105.138-.003 1.678.015 3.358-.007 5.036a8.05 8.05 0 0 1-1.68 4.869c-1.215 1.599-2.804 2.629-4.748 3.097a7.9 7.9 0 0 1-2.333.2c-1.868-.111-3.524-.774-4.939-2.004-1.46-1.264-2.38-2.855-2.75-4.762A8.6 8.6 0 0 1 9.6 18.11c-.003-1.59 0-3.176-.005-4.765 0-.106.034-.143.13-.173a25 25 0 0 1 3.107-.778c.01-.003.02 0 .044-.003v.123c0 1.994-.008 3.99.005 5.983.007 1.005.142 1.998.482 2.952.27.756.668 1.431 1.263 1.978.559.51 1.212.833 1.945.99 1.035.225 2.069.208 3.085-.115 1.2-.38 2.032-1.183 2.566-2.314.286-.603.457-1.244.565-1.902.12-.732.15-1.47.15-2.21v-5.34c-.003-.046-.003-.09-.003-.162"></path><path fill="#fff" d="M19.358 16.07H16.44V9.205c.304-.096 2.339-.104 2.917-.008zm56.981-5.497c0 1.56-.876 2.28-2.18 2.28s-2.15-.71-2.15-2.28V5.421h-2.814v5.248c0 3.42 2.845 4.762 4.979 4.762s4.983-1.342 4.983-4.761V5.42h-2.813zm-9.516-2.761v-2.39h-9.137v2.39h5.407l-5.628 5.046v2.391h9.695v-2.391h-5.955zm26.414-2.579c-1.782 0-3.126.73-3.79 1.84-.68-1.11-2.15-1.84-3.68-1.84-3.006 0-4.572 1.925-4.572 4.306v5.71h2.815V9.945c0-1.14.593-2.138 1.958-2.138a1.98 1.98 0 0 1 1.51.578c.196.197.347.435.448.698.096.264.14.542.12.821v5.35h2.815v-5.35c0-1.14.67-2.102 2.018-2.102 1.35 0 2 1.003 2 2.138v5.303h2.813V9.55c0-2.38-1.45-4.305-4.475-4.305zm-40.317 5.34c0 1.56-.875 2.28-2.169 2.28s-2.16-.71-2.16-2.28V5.421h-2.814v5.248c0 3.42 2.835 4.762 4.98 4.762 2.149 0 4.973-1.342 4.973-4.761V5.42h-2.814zm7.498 16.173c0 1.093.583 2.177 2.43 2.177 1.694 0 1.939-.996 1.939-.996h3.175s-.297 3.203-5.11 3.203c-3.357 0-5.47-1.848-5.47-5.149 0-3.29 2.113-5.128 5.429-5.128 3.284 0 5.386 1.838 5.386 5.128 0 .37-.053.765-.053.765zm.041-1.735h4.662c0-.79-.47-1.935-2.315-1.935-1.81 0-2.347 1.14-2.347 1.935m23.701 1.735c0 1.093.584 2.177 2.43 2.177 1.694 0 1.939-.996 1.939-.996h3.175s-.297 3.203-5.11 3.203c-3.357 0-5.469-1.848-5.469-5.149 0-3.29 2.112-5.128 5.428-5.128 3.284 0 5.386 1.838 5.386 5.128 0 .37-.052.765-.052.765zm.041-1.735h4.661c0-.79-.469-1.935-2.315-1.935-1.803 0-2.346 1.14-2.346 1.935m-28.413-.986c0-2.156-1.632-3.25-4.917-3.245-2.263 0-4.896.611-4.896 2.993 0 1.263.767 2.259 1.888 2.598 1.163.349 2.325.523 3.52.61.661.052 1.897.242 1.897.965-.01.673-.777 1.006-2.283 1.006-1.57 0-2.248-.338-2.248-1.242v-.303h-2.972v.303c0 2.238 1.726 3.352 5.214 3.352 3.499.01 5.266-1.042 5.266-3.141 0-1.587-1.152-2.552-2.58-2.829-1.388-.282-2.827-.313-3.979-.61-.5-.134-.756-.406-.756-.688 0-.601.61-.904 1.867-.904 1.235 0 2.013.17 2.013 1.134zm56.905 0c0-2.156-1.632-3.25-4.917-3.245-2.263 0-4.896.611-4.896 2.993 0 1.263.767 2.259 1.888 2.598 1.162.349 2.325.523 3.519.61.662.052 1.898.242 1.898.965-.011.673-.777 1.006-2.284 1.006-1.569 0-2.247-.338-2.247-1.242v-.303h-2.966v.303c0 2.238 1.725 3.352 5.213 3.352 3.499.01 5.266-1.042 5.266-3.141
 0-1.587-1.152-2.552-2.581-2.829-1.386-.282-2.825-.313-3.978-.61-.5-.129-.756-.401-.756-.683 0-.6.61-.904 1.867-.904 1.236 0 2.012.17 2.012 1.135h2.962zm-18.798.312v6.504h2.888v-4.363c0-1.679 1.246-2.762 2.815-2.762h1.888v-2.941h-1.418c-1.747 0-3.009 1.463-3.285 2.32v-2.12h-2.889zM73.498 17.12h-2.889v13.721h2.889zm5.668 0h-2.889v13.721h2.889z"></path></svg>
                    </RouterLink>
                <div class="flex items-center gap-2">
                    <button class="bg-[#fff] p-1 text-[14px] rounded-[7px]">Поддержка</button>
                    <button class="bg-[#ffffff] p-1 text-[14px] rounded-[7px]">Инструкция продавца</button>
                    <button @click="MenuOchil = !MenuOchil" class="x flex items-center gap-2 bg-[#ffffff] p-1 text-[14px] rounded-[7px]"><img class="w-[16px] h-[16px] rounded-[50%]" src="" alt=""> RU <i class="fa-solid fa-chevron-down text-[10px]"></i></button>
                    <button class="bg-[#7000ff] px-[13px] py-[6px] text-[14px] text-[#fff] rounded-[7px]">Войти</button>
                </div>
            </nav>
        </div>
    </div>
    <div v-if="MenuOchil" style="transition: all 0.3s;" class="bg-[#ffffff] w-[173px] p-[10px] rounded-[15px] absolute left-[1060px]">
            <button class="flex items-center gap-3 bg-[#ffffff] p-1 text-[14px]"><img class="w-[20px] h-[20px] rounded-[50%]" src="" alt=""> O'zbekcha <input type="radio"></button>
            <button class="flex items-center gap-[19px] p-1 text-[14px]"><img class="w-[20px] h-[20px] rounded-[50%]" src="" alt=""> Русский <input type="radio"></button>
    </div>
        <div class="">
            <div class="w-[394px] px-[30px] py-[24px] rounded-[20px] bg-[#fff] m-auto mt-[50px]">
            <h1 class="text-[22px] font-bold">Создание аккаунта</h1>
            <p class="text-[14px] mt-[8px] text-[#4d4f59]">На телефон и почту будут приходить уведомления и коды подтверждения</p>
            <input class="px-[12px] py-[0px] w-[330px] mt-[25px] h-[48px] rounded-[10px] bg-[#ecedef]" type="text" placeholder="Имя">
            <input class="px-[12px] py-[0px] w-[330px] mt-[15px] h-[48px] rounded-[10px] bg-[#ecedef]" type="text" placeholder="Телефон">
            <input class="px-[12px] py-[0px] w-[330px] mt-[15px] h-[48px] rounded-[10px] bg-[#ecedef]" type="text" placeholder="E-mail">
            <input class="px-[12px] py-[0px] w-[330px] mt-[15px] h-[48px] rounded-[10px] bg-[#ecedef]" type="text" placeholder="Пароль">
            <button class="bg-[#7000ff] text-[#fff] font-bold p-4 rounded-[10px] px-[113px] inline-block mt-[20px]">Продолжить</button>
            <div class="text-center">
                <p class="text-[12px] text-[#7e818c] mt-[15px]">Нажимая на кнопку, вы соглашаетесь c <br>
                    <span class="text-[#7f4dff]">Договором Оферты и Политикой Конфиденциальности</span></p>
            </div>
        </div>
        </div>
    </section>
</template>
